In [8]:
import numpy as np
import pandas as pd

**creating a data frames**

In [9]:
data = {
    'Name' :  ['John','Anna','Peter', 'Linda'],
    'Age' :   [28,34,29,42],
    'City':   ['New York' , 'Paris','Berlin','London'],
    'Salary': [65000,70000,62000,85000]
}
df = pd.DataFrame(data)
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [13]:
data_list= [
    ['john',28,'New YOrk',65000],
    [ 'Anna',34 ,'Paris', 70000],
    ['peter', 29 ,'Berlin', 62000],
    ['Linda' ,42, 'London',85000 ] 
]
df2= pd.DataFrame(data_list)
df2 
columns = ["name","age","city","salary"]
df2 = pd.DataFrame(data_list,columns = columns)
df2

    name  age      city  salary
0   john   28  New YOrk   65000
1   Anna   34     Paris   70000
2  peter   29    Berlin   62000
3  Linda   42    London   85000

**Selection and Indexing of Columns**

In [14]:
df2

    name  age      city  salary
0   john   28  New YOrk   65000
1   Anna   34     Paris   70000
2  peter   29    Berlin   62000
3  Linda   42    London   85000

In [17]:
df2['name']

0     john
1     Anna
2    peter
3    Linda
Name: name, dtype: object

In [18]:
df2['age']

0    28
1    34
2    29
3    42
Name: age, dtype: int64

In [19]:
df2['city']

0    New YOrk
1       Paris
2      Berlin
3      London
Name: city, dtype: object

In [20]:
df2['salary']

0    65000
1    70000
2    62000
3    85000
Name: salary, dtype: int64

**Creating a  New column**

**Removing Columns**

**Selecting Rows**

**Selecting Subsets Of Rows and Columns**

**Conditional Selection**